Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_wifi_shim.c
/****************************************************************************
 * board/contest_board/chip/bk7258_wifi_shim.c
 *
 * The platform services Beken's WiFi stack expects from its own SDK,
 * implemented on NuttX.  bk7258_wifi_osi.c covers the RTOS primitives;
 * this file covers everything else the link asked for.
 *
 * The functions here fall into three groups, and the difference between
 * them matters when something misbehaves on hardware:
 *
 *   REAL      - does the same thing the vendor function does, verified
 *               against the vendor source and register headers.  The
 *               interrupt routing and the device clock gate are both in
 *               this group, and both had to be: they touch hardware that
 *               nothing else in this port turns on.
 *
 *   ADEQUATE  - honest implementation of a service NuttX provides
 *               differently (logging, reset, ticks, memcpy-by-DMA).
 *
 *   PENDING   - deliberately inert, because the subsystem behind it is not
 *               ported yet.  Every one of these logs once, the first time
 *               it is called, so a boot on real hardware says which of them
 *               the stack actually reaches instead of leaving us to guess.
 *               That is the whole point: a silent stub is indistinguishable
 *               from a working one right up until it isn't.
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdarg.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <syslog.h>
#include <time.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/irq.h>

#include <arch/board/board.h>

#include "arm_internal.h"
#include "bk7258_memorymap.h"
#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Device clock gate.  SOC_SYS_REG_BASE + (0xc << 2) in Beken's sys_ll.h,
 * which is 0x44010030 here.  One bit per peripheral, and the bit number is
 * the CLK_PWR_ID_* enumerator itself -- MAC is 26, PHY is 27.
 *
 * This is the same register bk7258_wdt.c already pokes at bit 31 to start
 * the NMI watchdog clock (CLK_PWR_ID_WDG_CPU is 31), which is a useful
 * cross-check that the enumerator-equals-bit rule is right rather than a
 * coincidence of two adjacent numbers.
 */

#define BK7258_SYS_DEV_CLK_EN     (BK7258_SYS_BASE + (0xc << 2))

/* Anything at or above CLK_PWR_ID_H264 (32) lives in a second register.
 * WiFi never asks for one, so the split is recorded and refused rather
 * than half-implemented.
 */

#define BK7258_CLK_PWR_ID_H264    32

/* PM_CLK_CTRL_PWR_DOWN is 0 and PM_CLK_CTRL_PWR_UP is 1 -- from
 * modules/pm.h.  Worth naming rather than inlining: getting this polarity
 * backwards would leave the MAC and PHY clocks off, and the stack would
 * come up looking alive while every register read returned zero.
 */

#define BK7258_PM_CLK_PWR_UP      1
#define BK7258_PM_CLK_ID_PHY      27

/* Power islands.  cpu_power_sleep_wakeup, SOC_SYS_REG_BASE + (0x10 << 2).
 * One bit per domain, and the bit means "powered DOWN" -- see
 * bk_pm_module_vote_power_ctrl() for why that matters.
 *
 * Domain numbers are power_module_name_t: MEM1 is 0 and they run up to
 * ROM_PGEN at 15, which is the range sys_hal_module_power_ctrl() treats as
 * plain bits.  WIFIP_MAC is 9 and WIFI_PHY is 10.
 *
 * Sub-modules are not in that range and are not bits.  Beken derives them
 * arithmetically -- POWER_SUB_MODULE_NAME_PHY_BT is
 * POWER_MODULE_NAME_WIFI_PHY * PM_MODULE_SUB_POWER_DOMAIN_MAX, with the
 * siblings following on -- so a sub-module id divided by that multiplier
 * gives back its parent domain.  PHY_WIFI is 10 * 20 + 1 = 201, which is
 * the number the board printed when this shim first refused it.
 *
 * Deriving it beats a table of ranges: the table would have to be
 * rewritten every time Beken inserts a sub-module, and it silently would
 * not be.
 */

#define BK7258_SYS_POWER_SLEEP    (BK7258_SYS_BASE + (0x10 << 2))

#define BK7258_PM_POWER_ON        0
#define BK7258_PM_SUB_DOMAIN_MAX  20    /* PM_MODULE_SUB_POWER_DOMAIN_MAX */
#define BK7258_PM_DOMAIN_LAST     15    /* POWER_MODULE_NAME_ROM_PGEN     */

/* mac_type_t, from components/system.h */

#define BK7258_MAC_TYPE_BASE      0
#define BK7258_MAC_TYPE_STA       1
#define BK7258_MAC_TYPE_AP        2
#define BK7258_MAC_TYPE_BLUETOOTH 3

/* Log a PENDING call exactly once.  Repeating it would drown the console
 * if the stack polls, and the first call is the only one that carries
 * information anyway.
 */

#define BK7258_WIFI_PENDING(name)                                  \
  do                                                               \
    {                                                              \
      static bool once = false;                                    \
      if (!once)                                                   \
        {                                                          \
          once = true;                                             \
          syslog(LOG_WARNING, "wifi: %s not ported\n", (name));     \
        }                                                          \
    }                                                              \
  while (0)

/****************************************************************************
 * Private Data
 ****************************************************************************/

