Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_wifi_shim.c
/* Locally-administered MAC, standing in until the factory address can be
 * read out of eFuse.  Bit 1 of the first octet marks it locally
 * administered and bit 0 is clear (unicast), so it is a valid address that
 * cannot collide with a real Beken-assigned one.
 */

static uint8_t g_bk7258_base_mac[6] =
{
  0x02, 0x0b, 0x77, 0x00, 0x00, 0x01
};

static uint32_t g_bk7258_wifi_rx_frames;
static uint32_t g_bk7258_wifi_rx_bytes;

/****************************************************************************
 * Temporary: fault probe
 *
 * NuttX leaves BusFault and UsageFault disabled, so they escalate to Hard
 * Fault and the interrupted context is lost by the time _assert() prints --
 * every dump so far has shown _assert's own PC.  Enabling them and
 * attaching here keeps the exception unescalated, and the handler's
 * "context" argument IS the saved register frame, so REG_PC is the
 * instruction that actually faulted.
 ****************************************************************************/

static int bk7258_fault_probe(int irq, FAR void *context, FAR void *arg)
{
  FAR uint32_t *regs = (FAR uint32_t *)context;

  UNUSED(arg);

  syslog(LOG_ERR, "FAULT irq=%d PC=%08" PRIx32 " LR=%08" PRIx32
                  " CFSR=%08" PRIx32 " BFAR=%08" PRIx32 "\n",
         irq, regs[REG_PC], regs[REG_LR],
         getreg32(0xe000ed28), getreg32(0xe000ed38));

  PANIC();
  return OK;
}

void bk7258_wifi_fault_probe_install(void)
{
  irq_attach(5, bk7258_fault_probe, NULL);   /* BusFault   */
  irq_attach(6, bk7258_fault_probe, NULL);   /* UsageFault */
  modifyreg32(0xe000ed24, 0, (1u << 17) | (1u << 18));
}

/****************************************************************************
 * Public Functions -- REAL: SoC interrupt routing
 ****************************************************************************/

/****************************************************************************
 * Name: sys_drv_enable_mac_*_int / sys_drv_enable_modem_int
 *
 * Description:
 *   Beken routes these through sys_drv -> sys_hal -> sys_ll, and the sys_ll
 *   leaf sets one bit in cpu0_int_0_31_en / cpu0_int_32_63_en.  That is
 *   exactly the SoC routing matrix bk7258_irq.c already drives ahead of the
 *   NVIC, so up_enable_irq() is not an approximation of these functions --
 *   it is the same two register writes by a different name.
 *
 *   The mapping was taken from middleware/soc/bk7258/soc/sys_reg.h, where
 *   the *_EN_POS values are 31 in the 0..31 register and 0..4 in the 32..63
 *   one, i.e. interrupt lines 31 and 32..36.  BK7258_IRQ_* already carried
 *   those numbers.  modem is the odd one out: it is
 *   cpu0_wifi_int_phy_mpb_en, line 29, not a MAC line at all.
 *
 *   The vendor wraps each in a critical section; up_enable_irq() does its
 *   own read-modify-write under the same protection, so wrapping again
 *   would only nest.
 *
 ****************************************************************************/

uint32_t sys_drv_enable_mac_txrx_timer_int(void)
{
  up_enable_irq(BK7258_IRQ_MAC_TXRX_TMR);
  return 0;
}

uint32_t sys_drv_enable_mac_txrx_misc_int(void)
{
  up_enable_irq(BK7258_IRQ_MAC_TXRX_MISC);
  return 0;
}

uint32_t sys_drv_enable_mac_rx_trigger_int(void)
{
  up_enable_irq(BK7258_IRQ_MAC_RX_TRIG);
  return 0;
}

uint32_t sys_drv_enable_mac_tx_trigger_int(void)
{
  up_enable_irq(BK7258_IRQ_MAC_TX_TRIG);
  return 0;
}

uint32_t sys_drv_enable_mac_prot_int(void)
{
  up_enable_irq(BK7258_IRQ_MAC_PORT_TRIG);
  return 0;
}

uint32_t sys_drv_enable_mac_gen_int(void)
{
  up_enable_irq(BK7258_IRQ_MAC_GEN);
  return 0;
}

uint32_t sys_drv_enable_modem_int(void)
{
  up_enable_irq(BK7258_IRQ_PHY_MBP);
  return 0;
}

/****************************************************************************
 * Public Functions -- REAL: device clock gate
 ****************************************************************************/

/****************************************************************************
 * Name: bk_pm_clock_ctrl
 *
 * Description:
 *   Turn a peripheral's clock on or off.  This one is load-bearing and is
 *   the reason this file exists at all rather than a page of empty stubs:
 *   wifi_init.c:72-73 calls it for PM_CLK_ID_MAC and PM_CLK_ID_PHY, and
 *   that is the *only* place the WiFi MAC and radio clocks get switched on.
 *   Stubbed out, bk_wifi_init() would return success against dead hardware.
 *
 *   This port has already been bitten three times by that failure mode --
 *   the TIMER soft_reset, the flash write-protect, and the AON RTC clock
 *   domain -- so anything on a clock-enable path gets implemented, not
 *   stubbed.
 *
 *   Traced through: bk_pm_clock_ctrl -> sys_drv_dev_clk_pwr_up ->
 *   sys_hal_clk_pwr_ctrl, which is a read-modify-write of one bit in
 *   cpu_device_clk_enable.
 *
 ****************************************************************************/

int bk_pm_clock_ctrl(uint32_t module, uint32_t clock_state)
{
  uint32_t bit;

  if (module >= BK7258_CLK_PWR_ID_H264)
    {
      /* Second gate register (reserver_reg0xd).  Nothing in the WiFi path
       * reaches it; refuse loudly rather than write the wrong register.
       */

      syslog(LOG_WARNING, "wifi: clock id %" PRIu32 " out of range\n",
             module);
      return -1;
    }

  bit = 1u << module;

  if (clock_state == BK7258_PM_CLK_PWR_UP)
    {
      modifyreg32(BK7258_SYS_DEV_CLK_EN, 0, bit);
    }
  else
    {
      modifyreg32(BK7258_SYS_DEV_CLK_EN, bit, 0);
    }

  return 0;
}

/****************************************************************************
 * Public Functions -- ADEQUATE: logging and reset
 ****************************************************************************/

void bk_printf(const char *fmt, ...)
{
  va_list ap;

  va_start(ap, fmt);
  vsyslog(LOG_INFO, fmt, ap);
  va_end(ap);
}

void bk_printf_ext(int level, char *tag, const char *fmt, ...)
{
  va_list ap;

  UNUSED(level);
  UNUSED(tag);

  va_start(ap, fmt);
  vsyslog(LOG_INFO, fmt, ap);
  va_end(ap);
}

void bk_null_printf(const char *fmt, ...)
{
  UNUSED(fmt);
}

