Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_wifi_shim.c
/* Beken's shell buffers log output and flushes it at checkpoints.  syslog
 * writes straight through, so there is nothing to flush.
 */

void shell_log_flush(void)
{
}

int shell_assert_out(bool bcontinue, char *format, ...)
{
  va_list ap;

  va_start(ap, format);
  vsyslog(LOG_ERR, format, ap);
  va_end(ap);

  if (!bcontinue)
    {
      PANIC();
    }

  return 0;
}

void bk_reboot_ex(uint32_t reset_reason)
{
  syslog(LOG_ERR, "wifi: stack requested reboot, reason %" PRIu32 "\n",
         reset_reason);
  up_systemreset();
}

/****************************************************************************
 * Public Functions -- ADEQUATE: time, identity, bulk copy
 ****************************************************************************/

uint64_t bk_get_tick(void)
{
  return (uint64_t)clock_systime_ticks();
}

uint32_t bk_get_ticks_per_second(void)
{
  return TICK_PER_SEC;
}

/****************************************************************************
 * Name: bk_get_mac
 *
 * Description:
 *   The vendor reads the base address out of eFuse/OTP and derives the STA
 *   and AP addresses from it.  This port has no eFuse driver, so the base
 *   is a locally-administered address and the derivation is Beken's: AP
 *   differs from STA in the low bits of the last octet, which is what keeps
 *   a simultaneous STA+AP setup from using one address twice.
 *
 *   Reading the factory address (eFuse, or the net_param flash partition
 *   the RF calibration already lives in) is still to do.  Until then a
 *   board will not present the MAC printed on its label.
 *
 ****************************************************************************/

int bk_get_mac(uint8_t *mac, int type)
{
  if (mac == NULL)
    {
      return -1;
    }

  memcpy(mac, g_bk7258_base_mac, sizeof(g_bk7258_base_mac));

  switch (type)
    {
      case BK7258_MAC_TYPE_BASE:
        break;

      case BK7258_MAC_TYPE_STA:
        break;

      case BK7258_MAC_TYPE_AP:
        mac[5] ^= 0x01;
        break;

      case BK7258_MAC_TYPE_BLUETOOTH:
        mac[5] ^= 0x02;
        break;

      default:
        return -1;
    }

  return 0;
}

/****************************************************************************
 * Name: dma_memcpy
 *
 * Description:
 *   Beken hands large copies to a general-DMA channel.  We have no DMA
 *   driver for that block, and the CPU copy is correct if slower -- the
 *   caller cannot tell the difference because the vendor API is
 *   synchronous either way.
 *
 ****************************************************************************/

int dma_memcpy(void *out, const void *in, uint32_t len)
{
  memcpy(out, in, len);
  return 0;
}

/****************************************************************************
 * Name: ate_is_enabled
 *
 * Description:
 *   ATE is Beken's factory test mode, entered by a strapping pin their
 *   bootloader samples.  This port never enters it, and answering "yes"
 *   would divert the stack into calibration paths that expect test
 *   equipment on the other end of the radio.
 *
 ****************************************************************************/

bool ate_is_enabled(void)
{
  return false;
}

/****************************************************************************
 * Name: bk7258_wifi_rx_frame
 *
 * Description:
 *   Where received frames arrive from the vendor stack, handed across from
 *   ethernetif_input() in bk7258_wifi_pbuf.c.
 *
 *   For now this counts and drops.  That is not a placeholder for its own
 *   sake: the netdev lower half in bk7258_wifi.c has no RX queue yet, and
 *   the honest order of work is to see the stack actually deliver a frame
 *   before designing the queue that holds it.  The counters make that
 *   visible from the console the moment it happens.
 *
 ****************************************************************************/

void bk7258_wifi_rx_frame(int iface, const void *data, unsigned int len)
{
  UNUSED(data);

  g_bk7258_wifi_rx_frames++;
  g_bk7258_wifi_rx_bytes += len;

  if (g_bk7258_wifi_rx_frames == 1)
    {
      syslog(LOG_INFO, "wifi: first RX frame, iface %d, %u bytes\n",
             iface, len);
    }
}

/****************************************************************************
 * Public Functions -- REAL: power islands
 ****************************************************************************/

/****************************************************************************
 * Name: bk_pm_module_vote_power_ctrl
 *
 * Description:
 *   Switch a power island on.  Like the clock gate above, this one is
 *   load-bearing: wifi_init.c:67-69 powers WIFIP_MAC, PHY and the PHY's
 *   WiFi sub-domain here, three lines *before* it touches the clock, and
 *   rwnxl_init() a few lines further down is the first code to read MAC
 *   registers.  With this stubbed out, that read faults -- which is exactly
 *   what the board did: BusFault escalated to Hard Fault inside
 *   rwnxl_init(), with "wifi: power vote not ported" as the line above it
 *   in the log.
 *
 *   Two details are not guessable from the call site:
 *
 *   - The polarity is inverted.  The register is cpu_power_sleep_wakeup at
 *     SOC_SYS_REG_BASE + (0x10 << 2) = 0x44010040, and its bits are
 *     power-*down* bits: sys_hal_module_power_ctrl() clears the bit to
 *     power a domain on.  Writing the obvious way round would switch off
 *     whatever was already running.
 *
 *   - Sub-modules are not domains.  PM_POWER_SUB_MODULE_NAME_PHY_WIFI is
 *     201, a vote on the PHY domain (10), not a bit of its own; the vendor
 *     folds it into the parent and keeps a separate refcount so the domain
 *     survives until the last voter leaves.
 *
 *     Worth knowing where those numbers come from: bk_idk carries two
 *     modules/pm.h, and the one under components/tfm/ is a different,
 *     older layout that happens to agree about MAC and PHY and disagrees
 *     about everything after them.  The header on the vendor include path
 *     -- the one these numbers must match -- is bk_idk/include/modules/pm.h.
 *
 *   That refcount is why power-off is not implemented here.  WiFi is the
 *   only voter in this image, nothing ever asks for a domain to go away,
 *   and honouring an off vote without the vendor's bookkeeping would let
 *   one subsystem cut power out from under another.  An off request is
 *   accepted and ignored rather than half-obeyed.
 *
 *   Not done: the vendor also calls phy_wakeup_reinit() when the PHY
 *   domain comes up.  That is the resume-from-sleep path; a cold boot runs
 *   calibration_init() a few lines later in wifi_init(), which initialises
 *   the same hardware.  If the radio turns out to need it anyway, this is
 *   the first place to look.
 *
 ****************************************************************************/

int bk_pm_module_vote_power_ctrl(uint32_t module, uint32_t power_state)
{
  uint32_t domain;

  /* Fold a sub-module vote onto the domain that actually has a bit. */

