Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_wifi_shim.c
  domain = module >= BK7258_PM_SUB_DOMAIN_MAX ?
           module / BK7258_PM_SUB_DOMAIN_MAX : module;

  /* CPU1, CPU2 and APP sit above the bit range -- CPU1 and CPU2 have their
   * own halt/power sequences and APP is not a power domain at all.  Nothing
   * in the WiFi path asks for any of them.
   */

  if (domain > BK7258_PM_DOMAIN_LAST)
    {
      syslog(LOG_WARNING, "wifi: power domain %" PRIu32 " unsupported\n",
             module);
      return -1;
    }

  if (power_state == BK7258_PM_POWER_ON)
    {
      modifyreg32(BK7258_SYS_POWER_SLEEP, 1u << domain, 0);
    }

  return 0;
}

int bk_pm_sleep_register_cb(int sleep_mode, int dev_id,
                            void *enter_config, void *exit_config)
{
  UNUSED(sleep_mode);
  UNUSED(dev_id);
  UNUSED(enter_config);
  UNUSED(exit_config);

  BK7258_WIFI_PENDING("sleep callback");
  return 0;
}

/****************************************************************************
 * Public Functions -- PENDING: supplicant
 ****************************************************************************/

/* wpa_supplicant is not ported.  Everything below is the seam between the
 * driver and it: the control interface the driver uses to ask for a
 * connection, the socket interface that carries management and EAPOL
 * frames between them, and two IE helpers that live on the supplicant side
 * of the split.
 *
 * Scan and monitor do not go through here, so an unported supplicant costs
 * association, not the radio.  Which of these the stack reaches first is
 * the next thing to find out on hardware, and each one says so when it is
 * called.
 */

int wpa_ctrl_request(int cmd, void *data)
{
  UNUSED(cmd);
  UNUSED(data);

  BK7258_WIFI_PENDING("wpa_ctrl_request");
  return -1;
}

int wpa_ctrl_request_async(int cmd, void *data)
{
  UNUSED(cmd);
  UNUSED(data);

  BK7258_WIFI_PENDING("wpa_ctrl_request_async");
  return -1;
}

int wpa_ctrl_event(int event, void *data)
{
  UNUSED(event);
  UNUSED(data);

  BK7258_WIFI_PENDING("wpa_ctrl_event");
  return -1;
}

int wpa_ctrl_event_copy(int event, void *data, int len)
{
  UNUSED(event);
  UNUSED(data);
  UNUSED(len);

  BK7258_WIFI_PENDING("wpa_ctrl_event_copy");
  return -1;
}

void wpas_thread_start(void)
{
  BK7258_WIFI_PENDING("supplicant thread");
}

bool is_wpah_queue_full(void)
{
  return false;
}

/* The driver/supplicant socket interface (bk_patch/sk_intf.c).  A peek that
 * reports zero means "nothing waiting", which is the correct answer while
 * there is no supplicant to have queued anything.
 */

int ke_mgmt_packet_tx(unsigned char *buf, int len, int flag)
{
  UNUSED(buf);
  UNUSED(len);
  UNUSED(flag);

  BK7258_WIFI_PENDING("mgmt frame TX to supplicant");
  return 0;
}

int ke_mgmt_packet_rx(unsigned char *buf, int len, int flag)
{
  UNUSED(buf);
  UNUSED(len);
  UNUSED(flag);

  return 0;
}

int ke_l2_packet_rx(unsigned char *buf, int len, int flag)
{
  UNUSED(buf);
  UNUSED(len);
  UNUSED(flag);

  return 0;
}

int ke_mgmt_peek_rxed_next_payload_size(int flag)
{
  UNUSED(flag);
  return 0;
}

int ke_data_peek_rxed_next_payload_size(int flag)
{
  UNUSED(flag);
  return 0;
}

/* IE helpers that live in the supplicant's common code. */

const uint8_t *get_ie(const uint8_t *ies, size_t len, uint8_t eid)
{
  size_t i = 0;

  if (ies == NULL)
    {
      return NULL;
    }

  /* Walk the element chain.  This one is short enough to implement
   * correctly rather than stub: two bytes of header, then the body, and
   * a truncated element ends the walk.
   */

  while (i + 2 <= len)
    {
      uint8_t id  = ies[i];
      uint8_t ien = ies[i + 1];

      if (i + 2 + ien > len)
        {
          break;
        }

      if (id == eid)
        {
          return &ies[i];
        }

      i += 2 + ien;
    }

  return NULL;
}

int get_security_type_from_ie(uint8_t *ie_start, int len, uint16_t caps)
{
  UNUSED(ie_start);
  UNUSED(len);
  UNUSED(caps);

  BK7258_WIFI_PENDING("security type from IE");
  return 0;
}

bool sta_check_user_is_11b_1mbps_supported(void)
{
  return false;
}

/****************************************************************************
 * Public Functions -- PENDING: IP-stack glue
 ****************************************************************************/

/* These two are lwIP's, and NuttX owns the IP layer here instead.
 * sta_ip_down() tells lwIP to drop the interface's address; the netdev
 * lower half will do that through its own ifdown path once connect() is
 * real.  net_begin_send_arp_reply() is a gratuitous-ARP helper the vendor
 * uses after roaming, which NuttX's ARP layer handles on its own.
 */

void sta_ip_down(void)
{
  BK7258_WIFI_PENDING("sta_ip_down");
}

void net_begin_send_arp_reply(bool is_send_arp, bool is_allow_send_req)
{
  UNUSED(is_send_arp);
  UNUSED(is_allow_send_req);
}

/****************************************************************************
 * Public Functions -- REAL: interrupt registration
 ****************************************************************************/

/* Beken's ISRs take no arguments and return nothing; NuttX's take the irq
 * number, the interrupted context and the registered argument.  One
 * trampoline per line bridges the two, and the line number indexes it.
 */

#define BK7258_WIFI_ISR_MAX  64

static void (*g_bk7258_wifi_isr[BK7258_WIFI_ISR_MAX])(void);

static int bk7258_wifi_isr_trampoline(int irq, FAR void *context,
                                      FAR void *arg)
{
  unsigned int line = (unsigned int)(irq - NVIC_IRQ_FIRST);

  UNUSED(context);
  UNUSED(arg);

  if (line < BK7258_WIFI_ISR_MAX && g_bk7258_wifi_isr[line] != NULL)
    {
      g_bk7258_wifi_isr[line]();
    }

  return OK;
}

/****************************************************************************
 * Name: bk_int_isr_register
 *
 * Description:
 *   Attach a vendor ISR to an interrupt source.
 *
 *   Beken looks the source up in icu_int_map_table[src] to get the hardware
 *   line.  On BK7258 that table is the identity -- every one of its sixty
 *   entries maps source N to line N (middleware/soc/bk7258/soc/icu_map.h),
 *   MODEM at 29 and the six MAC lines at 31..36 included -- so the lookup
 *   collapses to an offset from NVIC_IRQ_FIRST.  Checked rather than
 *   assumed, because it is the kind of thing that is true until a chip
 *   revision reorders one entry.
 *
 *   This is what keeps the MAC interrupts from landing in
 *   irq_unexpected_isr(): sys_drv_enable_mac_*_int() above turns the lines
 *   on, and nothing else in this port attaches a handler to them.
 *
 ****************************************************************************/

