Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_wifi_shim.c
int bk_int_isr_register(uint32_t src, void (*isr)(void), void *arg)
{
  UNUSED(arg);

  if (src >= BK7258_WIFI_ISR_MAX)
    {
      syslog(LOG_WARNING, "wifi: isr source %" PRIu32 " out of range\n", src);
      return -1;
    }

  syslog(LOG_INFO, "wifi: isr register src %" PRIu32 "\n", src);

  g_bk7258_wifi_isr[src] = isr;

  if (isr == NULL)
    {
      irq_detach(NVIC_IRQ_FIRST + src);
      return 0;
    }

  return irq_attach(NVIC_IRQ_FIRST + src,
                    bk7258_wifi_isr_trampoline, NULL) == OK ? 0 : -1;
}

/****************************************************************************
 * Public Functions -- REAL: interrupt group masks and modem clock
 ****************************************************************************/

/* sys_drv_int_enable() takes a bit mask, not a line number, and writes the
 * same cpu0_int_*_en pair bk7258_irq.c drives one bit at a time.  Group 2
 * is the 32..63 half.
 */

uint32_t sys_drv_int_enable(uint32_t param)
{
  modifyreg32(BK7258_SYS_CPU0_INT_EN(0), 0, param);
  return 0;
}

uint32_t sys_drv_int_disable(uint32_t param)
{
  modifyreg32(BK7258_SYS_CPU0_INT_EN(0), param, 0);
  return 0;
}

uint32_t sys_drv_int_group2_enable(uint32_t param)
{
  modifyreg32(BK7258_SYS_CPU0_INT_EN(32), 0, param);
  return 0;
}

uint32_t sys_drv_int_group2_disable(uint32_t param)
{
  modifyreg32(BK7258_SYS_CPU0_INT_EN(32), param, 0);
  return 0;
}

/****************************************************************************
 * Name: sys_drv_modem_clk_ctrl / sys_drv_modem_bus_clk_ctrl
 *
 * Description:
 *   The modem clock is the PHY's, bit 27 of the same device clock gate
 *   bk_pm_clock_ctrl() drives -- sys_hal_modem_clk_ctrl() is one call to
 *   sys_ll_set_cpu_device_clk_enable_phy_cken().
 *
 *   The bus variant is empty here because it is empty in the vendor HAL
 *   too: sys_hal_modem_bus_clk_ctrl() on BK7258 carries the comment "7256
 *   no bus clock enable" and no body.  Worth stating, so nobody later reads
 *   this as an unfinished stub and goes looking for the register.
 *
 ****************************************************************************/

uint32_t sys_drv_modem_clk_ctrl(bool clk_en)
{
  bk_pm_clock_ctrl(BK7258_PM_CLK_ID_PHY,
                   clk_en ? BK7258_PM_CLK_PWR_UP : 0);
  return 0;
}

uint32_t sys_drv_modem_bus_clk_ctrl(bool clk_en)
{
  UNUSED(clk_en);
  return 0;
}

/****************************************************************************
 * Name: bk_pm_module_power_state_get
 *
 * Description:
 *   Note the sense: the register bit means "powered down", and the vendor's
 *   callers test the result against zero to mean "on".  Returning the raw
 *   bit is therefore correct and inverting it would be wrong, however
 *   backwards it reads.
 *
 ****************************************************************************/

int32_t bk_pm_module_power_state_get(uint32_t module)
{
  uint32_t domain = module >= BK7258_PM_SUB_DOMAIN_MAX ?
                    module / BK7258_PM_SUB_DOMAIN_MAX : module;

  if (domain > BK7258_PM_DOMAIN_LAST)
    {
      return 1;
    }

  return (getreg32(BK7258_SYS_POWER_SLEEP) >> domain) & 1;
}

/****************************************************************************
 * Public Functions -- ADEQUATE: time, logging
 ****************************************************************************/

uint64_t bk_aon_rtc_get_current_tick(uint32_t id)
{
  UNUSED(id);
  return (uint64_t)clock_systime_ticks();
}

float bk_rtc_get_ms_tick_count(void)
{
  return (float)TICK2MSEC(clock_systime_ticks());
}

void bk_printf_raw(int level, char *tag, const char *fmt, ...)
{
  va_list ap;

  UNUSED(level);
  UNUSED(tag);

  va_start(ap, fmt);
  vsyslog(LOG_INFO, fmt, ap);
  va_end(ap);
}

void bk_system_dump(void)
{
  syslog(LOG_ERR, "wifi: stack requested a system dump\n");
}

/* Build stamps for the closed PHY archives.  The real ones come from a
 * generated file the vendor build produces; nothing reads these except a
 * version print.
 */

char *bk_get_phy_libs_build_date(void)
{
  return "unknown";
}

char *bk_get_phy_libs_build_time(void)
{
  return "unknown";
}

char *bk_get_phy_libs_commit_id(void)
{
  return "unknown";
}

/****************************************************************************
 * Public Functions -- PENDING: flash-backed calibration
 ****************************************************************************/

/****************************************************************************
 * Name: bk_flash_partition_read / bk_spec_flash_write_bytes
 *
 * Description:
 *   The stack reads factory RF calibration and the MAC address out of named
 *   flash partitions (rf_firmware, net_param).  bk7258_flash.c can reach
 *   that flash, but this port has no partition table to resolve a name
 *   against -- the bootloader's table is read by name and offset only, and
 *   nothing in the tree parses it yet.
 *
 *   Failing is the right answer rather than returning zeroed data: the
 *   vendor treats a read failure as "no stored calibration" and falls back
 *   to the compiled defaults in bk7258_vnd_cal.c, whereas a successful read
 *   of zeros would be taken as real calibration and drive the radio with
 *   it.
 *
 *   This is the first thing to implement when transmit power looks wrong.
 *
 ****************************************************************************/

int bk_flash_partition_read(int partition, uint8_t *dst, uint32_t offset,
                           uint32_t size)
{
  UNUSED(partition);
  UNUSED(dst);
  UNUSED(offset);
  UNUSED(size);

  BK7258_WIFI_PENDING("flash partition read");
  return -1;
}

int bk_spec_flash_write_bytes(int partition, const uint8_t *src,
                              uint32_t size, uint32_t offset)
{
  UNUSED(partition);
  UNUSED(src);
  UNUSED(size);
  UNUSED(offset);

  BK7258_WIFI_PENDING("flash partition write");
  return -1;
}

/****************************************************************************
 * Public Functions -- PENDING: sensors, clocks, GPIO mux, power policy
 ****************************************************************************/

/* RC32K trim measurement, used to correct sleep timing.  This port does not
 * sleep the WiFi domain, so zero ppm error is the honest answer.
 */

uint32_t bk_ckmn_driver_get_rc32k_ppm(void)
{
  return 0;
}

/* Die temperature feeds the PHY's temperature compensation.  Without a
 * SARADC reading wired up the stack keeps its default compensation, which
 * is what it does on a board with no sensor.
 */

int bk_sensor_set_current_temperature(int temperature)
{
  UNUSED(temperature);
  return 0;
}

/* GPIO multiplexing for external RF control (antenna switch, PA enable).
 * The R1 board's radio has no such pins, so there is nothing to map.
 */

