Feeding/contest2026_252_EPG/board/contest_board/chip/bk7258_wifi_shim.c
int gpio_dev_map(uint32_t gpio_id, uint32_t dev)
{
  UNUSED(gpio_id);
  UNUSED(dev);
  return 0;
}

int gpio_dev_unmap(uint32_t gpio_id)
{
  UNUSED(gpio_id);
  return 0;
}

int gpio_dev_unprotect_map(uint32_t gpio_id, uint32_t dev)
{
  UNUSED(gpio_id);
  UNUSED(dev);
  return 0;
}

int gpio_dev_unprotect_unmap(uint32_t gpio_id)
{
  UNUSED(gpio_id);
  return 0;
}

/* Low-power analog trimming, entered around deep sleep. */

void sys_hal_enter_low_analog(void)
{
}

void sys_hal_exit_low_analog(void)
{
}

/* Remaining power-policy hooks.  All of them concern sleep, DVFS or the
 * external 32 kHz source, none of which this port uses.
 */

int bk_pm_lpo_src_get(void)
{
  return 0;
}

int bk_pm_module_vote_cpu_freq(uint32_t module, uint32_t cpu_freq)
{
  UNUSED(module);
  UNUSED(cpu_freq);
  return 0;
}

int bk_pm_module_vote_sleep_ctrl(uint32_t module, uint32_t sleep_state,
                                 uint32_t sleep_time)
{
  UNUSED(module);
  UNUSED(sleep_state);
  UNUSED(sleep_time);
  return 0;
}

/* The PHY re-initialises itself after the domain has been powered down.
 * Since this port never powers it down, the flag is always clear.
 */

uint32_t bk_pm_phy_reinit_flag_get(void)
{
  return 0;
}

void bk_pm_phy_reinit_flag_clear(void)
{
}

int pm_extern32k_register_cb(void *cfg)
{
  UNUSED(cfg);
  return 0;
}

/****************************************************************************
 * Public Functions -- PENDING: lwIP interface
 ****************************************************************************/

/* NuttX owns the IP stack, so none of lwIP is present.  The byte-order
 * helpers are real because they are pure arithmetic and the stack uses them
 * to build frames; everything else is a socket or a netif operation that
 * belongs to a stack we do not have, and will be replaced by the netdev
 * lower half as the RX and TX paths land.
 */

uint16_t lwip_htons(uint16_t n)
{
  return (uint16_t)((n << 8) | (n >> 8));
}

uint32_t lwip_htonl(uint32_t n)
{
  return ((n & 0xff) << 24) | ((n & 0xff00) << 8) |
         ((n & 0xff0000) >> 8) | (n >> 24);
}

int lwip_socket(int domain, int type, int protocol)
{
  UNUSED(domain);
  UNUSED(type);
  UNUSED(protocol);

  BK7258_WIFI_PENDING("lwip_socket");
  return -1;
}

int lwip_close(int s)
{
  UNUSED(s);
  return -1;
}

int lwip_sendto(int s, const void *data, size_t size, int flags,
                const void *to, uint32_t tolen)
{
  UNUSED(s);
  UNUSED(data);
  UNUSED(size);
  UNUSED(flags);
  UNUSED(to);
  UNUSED(tolen);

  BK7258_WIFI_PENDING("lwip_sendto");
  return -1;
}

int ip4addr_aton(const char *cp, void *addr)
{
  UNUSED(cp);
  UNUSED(addr);
  return 0;
}

char *ip4addr_ntoa(const void *addr)
{
  UNUSED(addr);
  return "0.0.0.0";
}

/* netif registration.  wlan0 already exists -- bk7258_wifi.c registered it
 * with netdev_lower_register() long before the vendor stack came up -- so
 * these are the vendor asking for something that has already happened.
 */

void *net_wlan_add_netif(void *mac)
{
  UNUSED(mac);

  BK7258_WIFI_PENDING("net_wlan_add_netif");
  return NULL;
}

int net_wlan_remove_netif(void *mac)
{
  UNUSED(mac);
  return 0;
}

int dhcp_lookup_mac(void *netif, void *ip, void *mac)
{
  UNUSED(netif);
  UNUSED(ip);
  UNUSED(mac);
  return -1;
}

void sta_ip_mode_set(int dhcp)
{
  UNUSED(dhcp);
}

void uap_ip_start(void)
{
  BK7258_WIFI_PENDING("uap_ip_start");
}

void uap_ip_down(void)
{
}
